int main()
{

	int arr1[11];
	for (int i = 0; i < 11; i++)//перебираємо значення від 0 до 10 (11 не включно)

	{

		if (i % 2 == 0)//перевірка індекса і на парність

		{

			arr1[i] = 6 * i - 9;

		}

		else //перевірка індекса і на непарність

		{

			arr1[i] = -9 + 2 * i;

		}

	}
	int size = 11;

	for (int i = 0; i < size - 1; i++)// визначаємо кількість проходів по масиву, для 11
		елементів кількість проходів буде 10

	{

		for (int j = 0; j < size - i - 1; j++)// перебираємо елементи в масиві

		{

			if (arr1[j] > arr1[j + 1])//якщо лівий елемент більший за правий, то міняємо їх
				місцями

			{

			int temp = arr1[j];

			arr1[j] = arr1[j + 1];

			arr1[j + 1] = temp;

			}

		}

	}
}