int main()
{
	int arr[5][4] = { {11,21,-3,4},

{5,-6,0,8},

{9,0,11,2},

{4,-4,4,1},

{0,1,-9,6} };
	int arr1[4];
	for (int i = 0; i < 4; i++)// прох≥д по вс≥м стовпц€м

	{

		int min = arr[0][i];//вибираЇмо початкове значенн€ дл€ м≥н≥мального елемента в стовпц≥ (це буде
		перше значенн€ з кожного стовпц€, т.б.значенн€ з ≥ндексом р€дка 0)

		for (int j = 0; j < 5; j++) // проходимо циклом по стовпцю (≥ндекси елемент≥в в кожному стовпц≥
			в≥д 0 до 5)

			{

				if (arr[j][i] < min)//€кщо знаходимо значенн€, €ке менше за м≥н≥мальне

				{

					min = arr[j][i];// то воно стаЇ нашим новим м≥н≥мальним значенн€м

				}

}

arr1[i] = min;//записуЇмо м≥н≥мальне значенн€ з р€дка в одновим≥рний масив

	}

}