int main()
{
	float arr[4][5] = { {1.1, -2.0, -8.34, 5.5, 1.2},

{-0.2, 1.34, 2.2, -3.5, 1.1},

{-2.9, -3.1, 4.4, 7.2, -8.1},

{-2.6, -1.2, 3.4, 5.4, 6.6} };
	for (int i = 0; i < 4; i++)//перебираємо рядки двовимірного масиву

	{

		float mult = 1;//створюємо початкове значення для добутку в кожному рядку

		for (int j = 0; j < 5; j++)//перебираємо елементи рядка (стовпці)

		{

			if (arr[i][j] < 0)//перевіряємо, що елемент від’ємний

			{

				mult = mult * arr[i][j];//домножаємо від’ємний елемент в добуток

			}

		}

		arr1[i] = mult;//присвоюємо результат добутку елементу одновимірного
		масиву

	}
}